{
  "learningModules": [
    {
      "id": 1,
      "name": "Первые шаги в IT",
      "descriptionMin": "Идеальный старт: основы работы с компьютером, алгоритмами и интерфейсами",
      "descriptionMax": "Этот модуль разработан специально для новичков, которые делают свои первые шаги в мире информационных технологий. Учащиеся познакомятся с базовыми понятиями: что такое операционная система, как устроен пользовательский интерфейс, зачем нужны файлы и папки, и как правильно с ними работать.\n\nНа практических занятиях ребята освоят навыки работы с мышью и клавиатурой, научатся запускать программы, открывать документы и сохранять информацию. Также будет рассмотрено устройство интернета и основы безопасного поведения в сети.\n\nКурс подходит для детей любого возраста, которые хотят уверенно чувствовать себя за компьютером и начать изучение программирования с прочной базы знаний.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/basic.png"
    },
    {
      "id": 2,
      "name": "Программируем с Scratch Jr",
      "descriptionMin": "Создание первых интерактивных историй и мини-игр через красочные блоки с командами",
      "descriptionMax": "Scratch Jr — это первый шаг в мир программирования для самых маленьких. В этом модуле дети от 5 до 7 лет создают простые анимации, истории и игры с помощью графического интерфейса, где вместо кода используются цветные блоки с действиями.\n\nУчащиеся научатся перемещать персонажей, менять их внешность, запускать звуки и взаимодействовать с объектами на экране. Простая и интуитивно понятная среда помогает развивать логическое мышление и творческие способности без необходимости набирать текст.\n\nЭтот курс формирует интерес к программированию и дает первые навыки алгоритмического мышления, необходимые для дальнейшего развития в более сложных языках программирования.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/scratch-jr.png"
    },
    {
      "id": 3,
      "name": "Программирование в Scratch",
      "descriptionMin": "Создание сложных аркадных игр с системой подсчета очков в полной версии Scratch",
      "descriptionMax": "Scratch — одна из самых популярных платформ для обучения программированию. Этот модуль предназначен для тех, кто уже имеет базовые навыки или хочет перейти к более серьезным проектам.\n\nУчащиеся будут создавать полноценные игры с уровнями, системой управления, счетчиками, анимацией и даже искусственным интеллектом для врагов и NPC. Также рассматриваются такие темы, как события, условия, циклы, переменные и списки.\n\nК концу курса ученики смогут не только реализовывать собственные идеи, но и объяснять принципы работы своих проектов, а также анализировать чужие программы, что закладывает основу для перехода на профессиональные языки программирования.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/scratch.png"
    },
    {
      "id": 4,
      "name": "Алгоритмика в Пиктомире",
      "descriptionMin": "Освоение базовых принципов программирования через управление роботом",
      "descriptionMax": "Пиктомир — уникальная образовательная среда, где учащиеся решают игровые задачи, составляя последовательности команд для робота. Это отличный способ познакомиться с понятием алгоритма и развить логическое мышление.\n\nКурс включает в себя задания различной сложности: от простого движения по лабиринту до создания циклов, условий и процедур. Все это помогает детям понять, как строится логика программирования и как выстраивать решения в условиях ограничений.\n\nПодходит как для школьников, так и для начинающих любого возраста, кто хочет получить фундаментальную подготовку перед изучением реальных языков программирования.",
      "totalClasses": 5,
      "totalDuration": "1,5 месяца",
      "image": "assets/images/modules/piktomir.png"
    },
    {
      "id": 5,
      "name": "CodeMonkey: программируем с обезьянкой",
      "descriptionMin": "Первые шаги в реальном коде через увлекательную игру на основе JavaScript",
      "descriptionMax": "CodeMonkey — интерактивная платформа, которая обучает программированию через увлекательные игровые задачи. Вместо визуального программирования здесь используется настоящий язык JavaScript, но в упрощённой форме, подходящей для новичков.\n\nУчащиеся помогают обезьянке собирать бананы, перемещаясь по координатной сетке и используя команды. Со временем задания усложняются, и ученики осваивают функции, циклы, массивы и другие важные конструкции языка.\n\nЭтот курс даёт возможность не просто играть, но и писать настоящий код, который работает, формируя правильные привычки программирования и понимание синтаксиса современных языков.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/codemonkey.png"
    },
    {
      "id": 6,
      "name": "Офисные супергерои",
      "descriptionMin": "Освоение PowerPoint, Excel и Word - ключевых программ для учебы и будущей профессии",
      "descriptionMax": "Этот модуль посвящен работе с офисными приложениями Microsoft Office: Word, Excel и PowerPoint. Эти инструменты являются стандартом в большинстве сфер деятельности — от образования до бизнеса и науки.\n\nУчащиеся научатся оформлять текстовые документы, создавать таблицы, диаграммы и презентации. Будет рассмотрена работа с шаблонами, стилями, графикой, гиперссылками и другими возможностями для создания качественных материалов.\n\nКурс поможет не только автоматизировать учебные задачи, но и подготовит к использованию офисных инструментов в профессиональной среде, в том числе при поступлении в вузы и дальнейшей карьере.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/office.png"
    },
    {
      "id": 7,
      "name": "Тайны компьютера",
      "descriptionMin": "Изучение устройства компьютера от \"железа\" до программного обеспечения",
      "descriptionMax": "Этот модуль раскрывает внутреннее устройство компьютера: от процессора и памяти до операционной системы и программного обеспечения. Учащиеся узнают, как работает «железо» и какие задачи выполняет софт.\n\nБудут рассмотрены компоненты системного блока, виды памяти, типы носителей информации, а также основы работы с операционными системами (Windows, Linux, macOS). Особое внимание уделяется вопросам безопасности и оптимизации производительности.\n\nКурс полезен всем, кто хочет лучше понимать, как работает его компьютер, и принимать более осознанные решения при выборе оборудования или настройке системы.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/hardware.png"
    },
    {
      "id": 8,
      "name": "Цифровое творчество",
      "descriptionMin": "Создание GIF-анимации и интерактивных QR-кодов для оживления проектов",
      "descriptionMax": "Модуль «Цифровое творчество» помогает учащимся применять технологии для самовыражения. Здесь создаются анимированные GIF-картинки, QR-коды, цифровые открытки и мультфильмы.\n\nИспользуются простые графические редакторы и онлайн-инструменты, позволяющие быстро получать результат. Учащиеся научатся работать с кадрами, эффектами и анимацией, а также создавать интерактивные элементы для своих проектов и презентаций.\n\nЭтот курс развивает воображение, учит визуальному восприятию и помогает создавать медиа-контент, который можно использовать в учебе, блогах, играх и социальных сетях.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/digital-art.png"
    },
    {
      "id": 9,
      "name": "Google Blockly",
      "descriptionMin": "Переход от игр к реальному коду через понятные блоки программирования",
      "descriptionMax": "Blockly — это визуальная система программирования от Google, которая позволяет ученикам создавать реальные скрипты, используя блоки вместо строк кода. Модуль помогает плавно перейти от игр к настоящему программированию.\n\nЗанятия включают решение логических задач, создание алгоритмов, работу с переменными и функциями. После окончания курса учащиеся смогут не только использовать готовые блоки, но и экспортировать свой код в JavaScript, Python или других языках.\n\nЭто отличный мост между визуальным программированием и текстовым кодом, особенно подходящий для тех, кто планирует заниматься разработкой программ и сайтов.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/blockly.png"
    },
    {
      "id": 10,
      "name": "Создание игр в Roblox Studio",
      "descriptionMin": "Разработка 3D-миров и многопользовательских проектов в профессиональной среде",
      "descriptionMax": "Roblox Studio — мощная платформа для создания 3D-игр и виртуальных миров. Этот курс подходит как для начинающих, так и для опытных разработчиков, желающих освоить продвинутые инструменты.\n\nУчащиеся научатся проектировать уровни, добавлять персонажей, писать скрипты на Lua, настраивать физику и организовывать многопользовательские режимы. Также рассматриваются вопросы дизайна, оптимизации и тестирования игр.\n\nПо окончании курса ученики смогут создавать собственные проекты, публиковать их в сообществе Roblox и приглашать друзей для совместной игры.",
      "totalClasses": 12,
      "totalDuration": "3 месяца",
      "image": "assets/images/modules/roblox.png"
    },
    {
      "id": 11,
      "name": "3D-игры в Kodu Game Lab",
      "descriptionMin": "Создание трехмерных миров и игр без сложного кода на визуальном языке",
      "descriptionMax": "Kodu Game Lab — это уникальная платформа для создания трёхмерных игр, ориентированная на начинающих разработчиков. В этом курсе учащиеся осваивают игровой движок через интуитивно понятный визуальный интерфейс, где вместо текстового программирования используются графические блоки.\n\nУченики создают собственные миры, добавляют персонажей, задают поведение объектам, программируют взаимодействия между ними. Модуль развивает логическое мышление, творческий подход и навыки работы с пространственными координатами и физикой.\n\nЭтот курс подходит как для школьников, так и для всех, кто хочет попробовать себя в игровой разработке без глубокого знания программирования. По окончании ученик сможет самостоятельно разрабатывать и презентовать свои 3D-проекты.",
      "totalClasses": 5,
      "totalDuration": "5 недель",
      "image": "assets/images/modules/kodu.png"
    },
    {
      "id": 12,
      "name": "Мобильная разработка в Thunkable",
      "descriptionMin": "Создание Android/iOS приложений через удобный визуальный конструктор",
      "descriptionMax": "Thunkable — одна из самых популярных платформ для создания мобильных приложений без написания кода. Этот модуль познакомит учащихся с основами мобильной разработки через дружелюбный интерфейс, похожий на Scratch.\n\nУченики научатся проектировать пользовательский интерфейс, добавлять элементы управления, работать с данными, использовать облачные базы данных и интегрировать сторонние API. Особое внимание уделяется функциональности: кнопкам, спискам, анимациям, геолокации и другим возможностям смартфонов.\n\nКурс подходит для тех, кто хочет быстро создать работающее приложение для iOS или Android, не углубляясь в Java или Swift. По завершении курса ученик получает портфолио из нескольких своих приложений, готовых к запуску на любом устройстве.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/thunkable.png"
    },
    {
      "id": 13,
      "name": "3D-Моделирование в Blender",
      "descriptionMin": "Освоение профессионального редактора для создания трехмерных проектов",
      "descriptionMax": "Blender — мощный инструмент для создания трёхмерной графики, анимаций и визуальных эффектов. Он используется как любителями, так и профессионалами в кино, играх и дизайне. В этом курсе вы освоите его с нуля.\n\nУчащиеся научатся создавать модели, работать с текстурами, светом и камерами, создавать анимацию и экспортировать проекты в различные форматы. Курс охватывает базовые и средние уровни владения Blender, включая моделирование, шейдинг и рендеринг.\n\nЭтот модуль подходит для творческих людей, которые хотят создавать объёмные проекты: от интерьеров до персонажей и короткометражных анимаций. По окончании курса ученик будет иметь полноценный 3D-портфель, который можно использовать для дальнейшего развития в этой сфере.",
      "totalClasses": 10,
      "totalDuration": "2,5 месяца",
      "image": "assets/images/modules/blender.png"
    },
    {
      "id": 14,
      "name": "Компьютерная грамотность",
      "descriptionMin": "Уверенная работа с ПК, полезные лайфхаки и главные цифровые навыки",
      "descriptionMax": "Этот модуль предназначен для тех, кто хочет уверенно чувствовать себя за компьютером. Здесь рассматриваются базовые и продвинутые навыки работы с операционной системой Windows, файловой системой, интернетом и офисными приложениями.\n\nУчащиеся узнают, как эффективно искать информацию, скачивать и устанавливать программы, работать с архивами, настраивать сетевые параметры, управлять дисками и пользователями. Также рассматриваются полезные советы по оптимизации производительности и организации рабочего места.\n\nКурс особенно полезен для новичков и школьников, которым нужно освоить компьютер для учебы, работы или повседневного использования. После прохождения курса ученик станет уверенным пользователем ПК, способным решать большинство типовых задач самостоятельно.",
      "totalClasses": 3,
      "totalDuration": "3 недели",
      "image": "assets/images/modules/literacy.png"
    },
    {
      "id": 15,
      "name": "Нейросети: цифровой помощник будущего",
      "descriptionMin": "Изучение современных нейросетевых технологий и их практическое применение",
      "descriptionMax": "Этот модуль знакомит учащихся с принципами работы искусственного интеллекта и нейронных сетей. Ученики узнают, как работают ИИ, какие задачи он может решать и как ими правильно пользоваться.\n\nЗанятия включают работу с реальными сервисами: генераторами текста, изображений, голоса и видео. Учащиеся также освоят основы анализа данных и машинного обучения, используя доступные инструменты без необходимости программировать.\n\nКурс подходит для школьников и студентов, интересующихся будущим технологий. По окончании ученик будет понимать, как работают современные ИИ-инструменты, и сможет применять их в учебе, творчестве и будущей карьере.",
      "totalClasses": 5,
      "totalDuration": "5 недель",
      "image": "assets/images/modules/ai.png"
    },
    {
      "id": 16,
      "name": "Игровое программирование в Run Marco!",
      "descriptionMin": "Освоение базовых принципов программирования через игру-платформер",
      "totalClasses": 2,
      "descriptionMax": "Run Marco! — образовательная платформа, которая обучает программированию через увлекательную игру-платформер. Это идеальный старт для тех, кто делает первые шаги в мире алгоритмов и логических конструкций.\n\nУчащиеся помогают герою пройти уровни, составляя последовательности команд, используя циклы, условия и переменные. Все задания построены в игровой форме, что делает обучение интересным и мотивирующим.\n\nКурс подходит как для детей, так и для взрослых, желающих начать изучать программирование без страха перед кодом. По окончании ученик будет понимать базовые концепции программирования и сможет перейти к более сложным языкам и средам.",
      "totalDuration": "2 недели",
      "image": "assets/images/modules/runmarco.png"
    },
    {
      "id": 17,
      "name": "3D-Проектирование в Tinkercad",
      "descriptionMin": "Полный цикл создания 3D-объектов - от проектирования до печати",
      "descriptionMax": "Tinkercad — онлайн-редактор от Autodesk, предназначенный для создания 3D-моделей. Он идеально подходит для новичков, которые хотят освоить основы 3D-дизайна и подготовить модели к 3D-печати.\n\nУчащиеся научатся строить фигуры, комбинировать детали, изменять параметры объектов, добавлять надписи и текстуры. Также будут рассмотрены темы оптимизации моделей, экспорта в STL и подготовки к печати на принтере.\n\nЭтот курс подходит для школьников, хобби-мастеров и всех, кто хочет создавать свои предметы с помощью технологий. По окончании ученик сможет спроектировать и напечатать собственный 3D-объект, будь то игрушка, украшение или деталь механизма.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/tinkercad.png"
    },
    {
      "id": 18,
      "name": "КиберБезопасность",
      "descriptionMin": "Важнейшие правила цифровой гигиены и защита от онлайн-опасностей",
      "descriptionMax": "Этот модуль посвящён основам цифровой безопасности — важнейшим правилам поведения в интернете, защите личных данных и предотвращению киберугроз. Особенно актуален в эпоху цифровых технологий и социальных сетей.\n\nУчащиеся узнают, как устроен интернет, что такое пароли, двухфакторная аутентификация, фишинг, вредоносное ПО и другие виды мошенничества. Будут даны практические рекомендации по защите аккаунтов, безопасному серфингу и общению в сети.\n\nКурс подходит для школьников и всех, кто хочет чувствовать себя уверенно в цифровом пространстве. По окончании ученик получит навыки, необходимые для защиты своей информации и минимизации рисков в интернете.",
      "totalClasses": 1,
      "totalDuration": "1 неделя",
      "image": "assets/images/modules/cybersecurity.png"
    },
    {
      "id": 19,
      "name": "Создание игр в Construct 3",
      "descriptionMin": "Профессиональная разработка игр без сложного программирования",
      "descriptionMax": "Construct 3 — мощная платформа для создания 2D-игр без необходимости глубокого программирования. Она позволяет разрабатывать игры через визуальные скрипты, события и действия, что делает её доступной даже для новичков.\n\nУчащиеся научатся создавать уровни, добавлять персонажей, реализовывать механику игры, работать с анимацией, звуком и управлением. Особое внимание уделяется логике и тестированию проектов.\n\nКурс подходит всем, кто хочет создавать собственные игры, не зная сложных языков программирования. По окончании ученик сможет разработать и опубликовать полноценную 2D-игру, которую можно запустить в браузере или на мобильных устройствах.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/construct.png"
    },
    {
      "id": 20,
      "name": "Инженерное проектирование в Компас-3D",
      "descriptionMin": "Освоение профессиональной системы автоматизированного проектирования",
      "descriptionMax": "Компас-3D — один из ключевых инструментов в инженерном дизайне, широко используемый в машиностроении, архитектуре и производстве. Этот курс поможет освоить все базовые и продвинутые функции программы.\n\nУчащиеся научатся создавать чертежи, моделировать детали и сборки, выполнять технические документы и работать с 3D-печатью. Будут рассмотрены такие темы, как параметрическое моделирование, библиотеки, спецификации и экспорт проектов.\n\nКурс подходит для школьников, студентов и молодых специалистов, планирующих связать свою жизнь с техническими специальностями. По окончании ученик получит опыт работы в профессиональной CAD-системе, востребованной во многих отраслях.",
      "totalClasses": 6,
      "totalDuration": "1,5 месяца",
      "image": "assets/images/modules/compass.png"
    },
    {
      "id": 21,
      "name": "Веб-разработка: HTML и CSS",
      "descriptionMin": "Создание веб-страниц с нуля с использованием фундаментальных технологий",
      "descriptionMax": "Этот курс является первым шагом в мир веб-разработки. Учащиеся осваивают базовые технологии — HTML для структуры страницы и CSS для её стилизации. Это основа любого сайта, которую должен знать каждый разработчик.\n\nНа занятиях учащиеся создают свои первые веб-страницы, работают с текстом, списками, таблицами, формами, изображениями и мультимедиа. Также рассматриваются современные подходы к верстке: Flexbox, Grid, адаптивный дизайн под мобильные устройства и работа с шрифтами.\n\nКурс подходит как для новичков, так и для тех, кто хочет систематизировать знания перед изучением JavaScript и других веб-технологий. По окончании ученик сможет самостоятельно создавать и публиковать сайты в интернете.",
      "totalClasses": 12,
      "totalDuration": "3 месяца",
      "image": "assets/images/modules/web.png"
    },
    {
      "id": 22,
      "name": "Профессиональный веб-дизайн в Figma / Pixso",
      "descriptionMin": "Создание стильных интерфейсов с современным UI/UX-инструментом",
      "descriptionMax": "Figma и Pixso — одни из самых популярных инструментов для создания пользовательских интерфейсов. Этот курс научит проектировать дизайны сайтов, мобильных приложений и веб-сервисов с нуля.\n\nУчащиеся узнают, как работать с компонентами, слоями, прототипированием и анимацией. Будут рассмотрены принципы цветового оформления, типографики, сеток и принципы хорошего UX/UI-дизайна. Особое внимание уделяется работе в команде и подготовке макетов для разработчиков.\n\nКурс подходит для тех, кто хочет стать UI/UX-дизайнером или просто научиться красиво оформлять свои проекты. По окончании ученик получает портфолио из нескольких готовых проектов, подходящих для презентации в образовательных или профессиональных целях.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/figma.png"
    },
    {
      "id": 23,
      "name": "Создание сайтов на Tilda",
      "descriptionMin": "Профессиональная вёрстка сайтов без программирования",
      "descriptionMax": "Tilda — это мощная платформа для создания сайтов без написания кода. Она активно используется в маркетинге, рекламе и для создания лендингов, корпоративных сайтов и портфолио.\n\nУчащиеся научатся работать с блоками, настраивать анимацию, добавлять формы обратной связи, видео, карты и другие элементы. Также рассматриваются вопросы SEO, оптимизации под мобильные устройства и публикации проекта в интернете.\n\nКурс идеально подходит для тех, кто хочет быстро создать продающий сайт, не зная HTML/CSS или JavaScript. По завершении ученик будет иметь опыт создания и публикации полноценного сайта, который можно использовать в учебных, творческих или коммерческих целях.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/tilda.png"
    },
    {
      "id": 24,
      "name": "Основы Python",
      "descriptionMin": "Изучение одного из самых популярных языков программирования",
      "descriptionMax": "Python — один из самых простых и востребованных языков программирования. Он используется в веб-разработке, анализе данных, машинном обучении, автоматизации и многом другом.\n\nКурс начинается с установки среды разработки и знакомства с синтаксисом. Учащиеся изучают переменные, условия, циклы, функции, списки, словари и файлы. Также рассматриваются основы объектно-ориентированного программирования и библиотеки стандартной поставки.\n\nЭтот курс подходит как для школьников, так и для взрослых, желающих начать карьеру в IT. По окончании ученик сможет решать практические задачи на Python и перейти к более продвинутым темам вроде веб-разработки, парсинга или анализа данных.",
      "totalClasses": 10,
      "totalDuration": "2,5 месяца",
      "image": "assets/images/modules/python.png"
    },
    {
      "id": 25,
      "name": "Чат-боты на Python",
      "descriptionMin": "Разработка интеллектуальных собеседников с искусственным интеллектом",
      "descriptionMax": "Этот модуль посвящён созданию чат-ботов — программ, которые общаются с людьми через текстовые сообщения. Основной акцент сделан на Python и его библиотеках (например, aiogram, telebot).\n\nУчащиеся научатся создавать ботов для Telegram, реализовывать меню, обрабатывать команды, хранить данные пользователей и даже интегрировать ИИ-модели для генерации ответов. Также рассматриваются темы безопасности, тестирования и деплоя ботов.\n\nКурс подходит для тех, кто хочет сделать свой первый проект в сфере искусственного интеллекта или автоматизации. По окончании ученик получит несколько работающих ботов, готовых к запуску в Telegram.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/chatbots.png"
    },
    {
      "id": 26,
      "name": "Основы JavaScript",
      "descriptionMin": "Создание интерактивных веб-страниц и динамического контента",
      "descriptionMax": "JavaScript — ключевой язык для создания динамических веб-страниц. Он позволяет добавлять анимацию, обрабатывать события, изменять содержимое страницы и взаимодействовать с сервером.\n\nУчащиеся освоят синтаксис языка, работу с DOM, события, функции, массивы, объекты и асинхронность. Также будут рассмотрены современные возможности ES6+ и использование библиотек, таких как jQuery.\n\nЭтот курс подходит для тех, кто уже знает HTML и CSS и хочет перейти к интерактивным веб-приложениям. По окончании ученик сможет создавать полностью динамические веб-страницы и переходить к фреймворкам, таким как React, Vue или Angular.",
      "totalClasses": 12,
      "totalDuration": "3 месяца",
      "image": "assets/images/modules/javascript.png"
    },
    {
      "id": 27,
      "name": "2D-игры на C#",
      "descriptionMin": "Разработка игр на языке C# с использованием фреймворка Unity",
      "descriptionMax": "C# — мощный язык программирования, особенно популярный в игровой разработке благодаря движку Unity. В этом курсе учащиеся создают полноценные 2D-игры от идеи до публикации.\n\nУчащиеся изучают основы Unity, работу с анимациями, физикой, коллайдерами, скриптами и событиями. Также рассматриваются темы управления игроком, создания уровней, работы с аудио и UI.\n\nКурс подходит как для школьников, так и для взрослых, интересующихся игровой разработкой. По окончании ученик получит опыт создания и публикации своих 2D-проектов, что может стать началом карьеры в этой сфере.",
      "totalClasses": 10,
      "totalDuration": "2,5 месяца",
      "image": "assets/images/modules/csharp.png"
    },
    {
      "id": 28,
      "name": "Основы Java",
      "descriptionMin": "Изучение кроссплатформенного языка для мобильных и enterprise-систем",
      "descriptionMax": "Java — один из самых востребованных языков программирования, используемых в мобильной разработке (Android), серверных приложениях, банковских системах и больших проектах.\n\nКурс охватывает синтаксис Java, работу с классами и объектами, коллекциями, потоками, исключениями и файловой системой. Учащиеся также познакомятся с основами Android-разработки и возможностями JVM.\n\nПодходит для тех, кто планирует карьеру в enterprise-разработке, мобильных приложениях или хочет освоить один из самых распространённых языков программирования. По окончании ученик сможет создавать консольные и графические приложения на Java.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/java.png"
    },
    {
      "id": 29,
      "name": "PHP + SQL",
      "descriptionMin": "Создание динамических сайтов с базой данных и серверным программированием",
      "descriptionMax": "Этот курс посвящён разработке динамических веб-сайтов с использованием языка PHP и систем управления базами данных (MySQL). Учащиеся научатся создавать сайты, которые не просто отображают информацию, но и взаимодействуют с пользователями, обрабатывают данные и сохраняют их в базе.\n\nНа занятиях рассматриваются темы: подключение к БД, работа с запросами SELECT, INSERT, UPDATE, DELETE, формы, сессии, авторизация и регистрация пользователей, безопасность и защита от SQL-инъекций. Также будет затронута интеграция с фронтендом через HTML/CSS и JavaScript.\n\nКурс подходит как для тех, кто хочет стать backend-разработчиком, так и для тех, кто хочет понять, как устроены реальные сайты. По окончании ученик сможет самостоятельно создать сайт с регистрацией, гостевой книгой, блогом или интернет-магазином.",
      "totalClasses": 6,
      "totalDuration": "1,5 месяца",
      "image": "assets/images/modules/php.png"
    },
    {
      "id": 30,
      "name": "Adobe Photoshop",
      "descriptionMin": "Освоение главного инструмента графических дизайнеров",
      "descriptionMax": "Adobe Photoshop — один из самых популярных графических редакторов в мире. Он используется в фотографии, дизайне, рекламе, верстке, анимации и многом другом. Этот курс поможет освоить его с нуля до уверенного использования.\n\nУчащиеся научатся работать со слоями, масками, кистями, текстом, цветокоррекцией и эффектами. Будут рассмотрены такие темы, как ретушь фотографий, создание логотипов, баннеров, постеров, коллажей и даже простых анимаций.\n\nКурс подходит для школьников, студентов и всех, кто хочет начать путь в графическом дизайне. По окончании ученик получит портфолио из готовых проектов, подходящих для учебы, работы или творчества.",
      "totalClasses": 6,
      "totalDuration": "1,5 месяца",
      "image": "assets/images/modules/photoshop.png"
    },
    {
      "id": 31,
      "name": "Олимпиадное программирование",
      "descriptionMin": "Продвинутые алгоритмы и решение сложных задач чемпионатного уровня",
      "descriptionMax": "Этот модуль предназначен для тех, кто уже имеет опыт программирования и хочет выйти на новый уровень — решать сложные задачи, участвовать в олимпиадах и конкурсах, а также подготовиться к профильным вузам и собеседованиям в IT-компании.\n\nКурс включает изучение структур данных (стек, очередь, деревья, графы), алгоритмов сортировки и поиска, динамического программирования, теории чисел, комбинаторики и геометрии. Особое внимание уделяется анализу сложности алгоритмов и оптимизации кода.\n\nПодходит для старшеклассников и студентов, планирующих карьеру в разработке ПО или участвующих в соревнованиях по программированию. По окончании ученик будет готов к соревнованиям уровня муниципальных и региональных этапов Всероссийской олимпиады.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/olympiad.png"
    },
    {
      "id": 32,
      "name": "Видеомонтаж в CapCut",
      "descriptionMin": "Создание качественного видео с эффектами для соцсетей",
      "descriptionMax": "CapCut — мощный видеоредактор, особенно популярный среди контент-мейкеров, блогеров и TikTok-мастеров. Этот курс научит создавать профессиональные ролики для YouTube, Instagram, Telegram и других платформ.\n\nУчащиеся узнают, как монтировать видео, добавлять переходы, текст, звуковые эффекты, работать с ключами прозрачности, шаблонами и стикерами. Также будут рассмотрены темы цветокоррекции, добавления голосовых комментариев и экспорта видео в разных форматах.\n\nКурс подходит для школьников, студентов и начинающих блогеров, желающих научиться создавать привлекательный видеоконтент. По завершении ученик сможет выпускать качественные видео для личных и коммерческих целей.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/capcut.png"
    },
    {
      "id": 33,
      "name": "Чертежник и Черепаха",
      "descriptionMin": "Обучение алгоритмам через графических исполнителей в игровой форме",
      "descriptionMax": "Этот модуль представляет собой введение в программирование через графических исполнителей — Чертёжника и Черепаху. Занятия проводятся в игровой форме, где каждая команда меняет поведение персонажа на экране.\n\nУчащиеся научатся составлять алгоритмы, использовать циклы, условия, процедуры и переменные. Все задания направлены на развитие логического мышления, внимательности и способности к анализу.\n\nКурс идеально подходит для школьников, которые делают первые шаги в программировании, а также может использоваться как часть подготовки к олимпиадам по информатике. По окончании ученик будет понимать основы алгоритмизации и сможет применять их в более сложных языках программирования.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/turtle.png"
    },
    {
      "id": 34,
      "name": "Motion-design",
      "descriptionMin": "Создание динамических визуальных эффектов и анимационных роликов",
      "descriptionMax": "Motion-design — это искусство создания анимированных визуальных эффектов, используемых в рекламе, кино, интерфейсах и презентациях. Этот курс научит создавать динамические заставки, логотипы, интро, анимационные ролики и UI-анимацию.\n\nУчащиеся будут работать в современных инструментах, таких как Adobe After Effects, Blender, или онлайн-редакторах. Темы включают работу с ключевыми кадрами, масками, текстурными эффектами, движением объектов, звуковым сопровождением и экспорт проектов.\n\nКурс подходит для тех, кто интересуется дизайном, анимацией и цифровым искусством. По окончании ученик получит несколько готовых анимационных роликов для своего портфолио.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/motion.png"
    },
    {
      "id": 35,
      "name": "Мини-приложения в Telegram",
      "descriptionMin": "Разработка простых игр и сервисов прямо внутри мессенджера",
      "descriptionMax": "Telegram Mini Apps — это возможность запускать веб-приложения прямо внутри мессенджера без необходимости установки. Этот курс научит создавать мини-игры, квизы, чат-ботов, сервисы заказа еды и другие полезные приложения.\n\nУчащиеся освоят работу с WebApp API, библиотеками, интерфейсом Telegram, хранением данных и интеграцией с ботами. Также рассматриваются вопросы безопасности, тестирования и публикации приложений.\n\nКурс подходит для тех, кто хочет быстро создавать и запускать проекты без глубокого знания мобильной разработки. По окончании ученик получит несколько работающих приложений, доступных через Telegram.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/tgmini.png"
    },
    {
      "id": 36,
      "name": "Интернет-магазин на JS + Telegram",
      "descriptionMin": "Создание функционального магазина с интеграцией в Telegram",
      "descriptionMax": "Этот курс научит создавать полностью рабочий интернет-магазин с помощью JavaScript и Telegram Bot API. Учащиеся реализуют каталог товаров, корзину, оплату, уведомления и интеграцию с мессенджером.\n\nБудут рассмотрены такие темы, как создание фронтенда на HTML/CSS/JS, обработка событий, localStorage, работа с Telegram-ботами, интеграция платежных систем (например, ЮKassa) и автоматизация заказов.\n\nКурс подходит для тех, кто хочет создать свой первый коммерческий проект или научиться делать решения «под ключ». По окончании ученик получит полноценный интернет-магазин, который можно запустить и использовать в реальном бизнесе.",
      "totalClasses": 6,
      "totalDuration": "1,5 месяца",
      "image": "assets/images/modules/tgshop.png"
    },
    {
      "id": 37,
      "name": "GitHub для разработчиков",
      "descriptionMin": "Контроль версий и публикация проектов на профессиональной платформе",
      "descriptionMax": "GitHub — это одна из ключевых платформ для хранения, тестирования и совместной разработки программного обеспечения. Этот курс научит работать с системой контроля версий Git и использовать GitHub как профессиональный инструмент.\n\nУчащиеся освоят создание репозиториев, коммиты, ветки, слияние изменений, работу с Pull Request'ами и командную разработку. Также будут рассмотрены темы автоматизации сборок через GitHub Actions, документации, публикации проектов и управления задачами через Issues и Projects.\n\nКурс подходит как для школьников, так и для начинающих разработчиков, которые хотят войти в профессиональное сообщество. По окончании ученик сможет самостоятельно управлять своими проектами и участвовать в open-source-разработке.",
      "totalClasses": 6,
      "totalDuration": "1.5 месяца",
      "image": "assets/images/modules/github.png"
    },
    {
      "id": 38,
      "name": "Аудиомонтаж",
      "descriptionMin": "Обработка и редактирование звука. Создание подкастов, треков и звуковых спецэффектов",
      "descriptionMax": "Этот модуль посвящён работе с аудио — от простого монтажа до создания музыки, голосовых дорожек и звуковых эффектов. Учащиеся освоят современные аудиоредакторы (например, Audacity, GarageBand или Adobe Audition).\n\nЗанятия включают запись голоса, удаление шума, наложение музыки, регулировку громкости, добавление спецэффектов и экспорт финального файла. Также рассматриваются форматы звука, частоты дискретизации и основы звукорежиссуры.\n\nКурс подходит для школьников, студентов, подкастеров и творческих людей, желающих создавать качественный звуковой контент. По окончании ученик получит портфолио из готовых аудиозаписей: подкасты, интервью, музыкальные ремиксы и даже радиоспектакли.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/audio-editing.png"
    },
    {
      "id": 39,
      "name": "Postman для API",
      "descriptionMin": "Тестирование и разработка API. Взаимодействие с веб-сервисами, создание запросов",
      "descriptionMax": "Postman — один из самых популярных инструментов для работы с API. Он используется разработчиками, тестировщиками и аналитиками для проверки, документирования и создания веб-запросов.\n\nУчащиеся научатся отправлять GET, POST, PUT, DELETE-запросы, работать с параметрами, заголовками, телом запроса и обрабатывать ответы сервера. Также будут рассмотрены коллекции, автоматизация тестов, переменные среды и интеграция с CI/CD.\n\nКурс подходит для тех, кто хочет стать QA-инженером, backend-разработчиком или просто научиться взаимодействовать с веб-сервисами. По окончании ученик сможет тестировать API и использовать Postman как полноценный инструмент разработки.",
      "totalClasses": 1,
      "totalDuration": "1 неделя",
      "image": "assets/images/modules/postman.png"
    },
    {
      "id": 40,
      "name": "Разработка игр в Godot",
      "descriptionMin": "Создание 2D и 3D игр с нуля в открытой игровой системе",
      "descriptionMax": "Godot Engine — мощная и бесплатная игровая система с открытым исходным кодом, которая позволяет создавать игры в 2D и 3D. Этот курс поможет освоить её с нуля и создать собственные игровые проекты.\n\nУчащиеся научатся работать с сценами, объектами, скриптами на GDScript (похож на Python), анимацией, физикой, UI и звуком. Будут рассмотрены такие темы, как управление игроком, искусственный интеллект, камеры, уровни и публикация проектов на разных платформах.\n\nКурс подходит для школьников и всех, кто хочет начать карьеру в игровой разработке без ограничений проприетарных движков. По окончании ученик получит опыт создания и публикации нескольких своих игр.",
      "totalClasses": 8,
      "totalDuration": "2 месяца",
      "image": "assets/images/modules/godot.png"
    },
    {
      "id": 41,
      "name": "MongoDB",
      "descriptionMin": "NoSQL-система управления базами данных. Работа с данными в формате JSON",
      "descriptionMax": "MongoDB — одна из самых популярных NoSQL-баз данных, используемая в современных веб-приложениях, микросервисных архитектурах и big data. Этот курс поможет освоить работу с неструктурированными данными.\n\nУчащиеся научатся создавать коллекции, добавлять и обновлять документы, выполнять запросы, использовать индексы, агрегацию и связи между данными. Также рассматриваются вопросы безопасности, резервного копирования и масштабируемости.\n\nКурс подходит для тех, кто хочет стать backend-разработчиком или специалистом по данным. По окончании ученик сможет эффективно использовать MongoDB в реальных проектах и интегрировать её с языками программирования, такими как Node.js, Python и Java.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/mongo.png"
    },
    {
      "id": 42,
      "name": "CodeCombat",
      "descriptionMin": "Игровая платформа для изучения программирования через увлекательные квесты",
      "descriptionMax": "CodeCombat — это образовательная платформа, где программирование преподносится как увлекательная игра. Учащиеся пишут настоящий код, чтобы управлять героем, решать логические задачи и побеждать врагов.\n\nМодуль охватывает базовые понятия программирования: переменные, условия, циклы, функции, массивы и объекты. Все задания построены в игровой форме, что делает обучение интересным и мотивирующим.\n\nКурс подходит для школьников и новичков любого возраста. По окончании ученик будет понимать структуру кода и сможет перейти к более сложным языкам и средам программирования.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/codecombat.png"
    },
    {
      "id": 43,
      "name": "Видео в Animoto",
      "descriptionMin": "Создание презентационных и рекламных роликов из фото, видео и музыки",
      "descriptionMax": "Animoto — удобный онлайн-инструмент для создания видео из фотографий, клипов и музыки. Он активно используется в маркетинге, образовании и блогинге для быстрого производства видеоконтента.\n\nУчащиеся научатся выбирать и обрабатывать медиа, добавлять текст, переходы, фоновую музыку, создавать слайд-шоу и короткие рекламные ролики. Особое внимание уделяется оформлению, композиции и правилам хорошего видеоряда.\n\nКурс подходит для школьников, студентов и начинающих маркетологов, желающих научиться делать красивые видео без глубокого знания видеомонтажа. По завершении ученик получит несколько готовых роликов для портфолио или соцсетей.",
      "totalClasses": 2,
      "totalDuration": "2 недели",
      "image": "assets/images/modules/animoto.png"
    },
    {
      "id": 44,
      "name": "Блоггинг",
      "descriptionMin": "Создание и ведение авторских блогов. Написание статей и создание контента",
      "descriptionMax": "Этот модуль посвящён созданию и развитию личного блога. Учащиеся узнают, как выбрать тематику, планировать контент, писать интересные тексты и продвигать свои идеи в интернете.\n\nЗанятия включают написание статей, создание визуального контента, работу с SEO, анализ аудитории и использование социальных сетей для продвижения. Также рассматриваются способы монетизации блога и построения цифрового бренда.\n\nКурс подходит для школьников, студентов и всех, кто хочет научиться выражать свои мысли, делиться опытом и строить онлайн-присутствие. По окончании ученик получит полностью оформленный блог и опыт создания регулярного контента.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/blogging.png"
    },
    {
      "id": 45,
      "name": "Программирование на C++",
      "descriptionMin": "Мощный язык для создания высокопроизводительных приложений, игр и системного ПО",
      "descriptionMax": "C++ — один из самых мощных и производительных языков программирования, используемых в разработке игр, системном программировании, высоконагруженных приложениях и embedded-системах. Этот курс поможет освоить его с нуля до уверенного уровня.\n\nУчащиеся изучат базовый синтаксис, работу с переменными, условиями, циклами, функциями, массивами и указателями. Также будут рассмотрены продвинутые темы: объектно-ориентированное программирование, работа с файлами, шаблоны, STL (стандартная библиотека) и управление памятью.\n\nКурс подходит как для школьников, так и для студентов и начинающих разработчиков, желающих войти в индустрию разработки ПО. По окончании ученик сможет создавать консольные приложения, простые игры и использовать C++ в реальных проектах.",
      "totalClasses": 12,
      "totalDuration": "3 месяца",
      "image": "assets/images/modules/cpp.png"
    },
    {
      "id": 46,
      "name": "Графика в CorelDRAW",
      "descriptionMin": "Создание векторной графики: логотипов, иллюстраций и макетов",
      "descriptionMax": "CorelDRAW — профессиональный редактор векторной графики, используемый дизайнерами по всему миру. Он позволяет создавать логотипы, иллюстрации, рекламные баннеры, упаковку и другие элементы дизайна.\n\nУчащиеся научатся работать с контурами, формами, текстом, градиентами, эффектами и слоями. Будут рассмотрены принципы композиции, типографики и подготовки макетов к печати или публикации в интернете.\n\nКурс подходит для школьников, студентов и всех, кто хочет начать карьеру в графическом дизайне. По окончании ученик получит портфолио из готовых проектов, подходящих для образовательных и профессиональных целей.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/coreldraw.png"
    },
    {
      "id": 47,
      "name": "Видеомонтаж в DaVinci Resolve",
      "descriptionMin": "Профессиональный монтаж видео и цветокоррекция. Создание фильмов",
      "descriptionMax": "DaVinci Resolve — один из самых мощных видеоредакторов, используемых не только любителями, но и профессионалами в киноиндустрии. Он объединяет монтаж, цветокоррекцию, звуковой дизайн и спецэффекты в одном интерфейсе.\n\nУчащиеся освоят работу с Timeline, переходами, эффектами, масками, ключами прозрачности и цветокоррекцией. Также будут рассмотрены вопросы работы со звуком, добавления титров и экспорта финального ролика в разных форматах.\n\nКурс подходит для школьников, студентов и начинающих видеомейкеров, желающих научиться создавать качественные фильмы, обучающие ролики или контент для соцсетей. По окончании ученик получит опыт создания полноценных видеоработ от идеи до финального монтажа.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/davinci.png"
    },
    {
      "id": 48,
      "name": "Блокчейн технологии",
      "descriptionMin": "Изучение основ блокчейна, цифровых записей и безопасных транзакций",
      "descriptionMax": "Блокчейн — это технология децентрализованного хранения данных, которая используется в криптовалютах, смарт-контрактах, NFT, цифровой идентификации и других инновационных системах. Этот курс поможет понять, как она работает и где применяется.\n\nУчащиеся узнают, что такое блок, цепочка, хэширование, криптография, майнинг, кошельки, транзакции и смарт-контракты. Также рассматриваются примеры использования блокчейна в бизнесе, государственных системах и финансах.\n\nКурс подходит для школьников, студентов и всех, кто интересуется цифровыми технологиями будущего. По окончании ученик будет понимать принципы блокчейн-технологий и сможет применять их в учебных и практических задачах.",
      "totalClasses": 4,
      "totalDuration": "1 месяц",
      "image": "assets/images/modules/blockchain.png"
    }
  ]
}
